
# Ашигласан өгөгдлийн эх сурвалж ------------------------------------------

# https://www.1212.mn/

# "1212.xlsx" файл дахь өгөгдөлд 1. Он 2. Өр гэсэн хоёр санамсаргүй хувьсагч байна.

# Өгөгдөл ачаалах ---------------------------------------------------------

data <- readxl::read_excel(
  path = "1212.xlsx",
  trim_ws = TRUE, # нүдний эхлэл дэх сул зайг арилгах
  skip = 1,
  col_names = FALSE
)

View(data)

# Өгөгдлийн бүтэц зохион байгуулалт ---------------------------------------

# Эхний багана дахь мэдээлэл шаардлагагүй тул түүнийг устгана.
data[1] <- NULL
data <- as.data.frame(t(data))

# Жижиг сажиг засвар
colnames(data) <- c("year", "debt")
rownames(data) <- NULL

# эмхэлсэн өгөгдлөө харах
View(data)

# Файлд хадгалах ----------------------------------------------------------

write.csv(x = data, file = "tidy.csv", row.names = FALSE) # Гарсан үр дүнг CSV форматаар экспортлох
