
# Ашигласан өгөгдлийн эх сурвалж ------------------------------------------

# Г.Махгал - Онлайн шалгалтын дүн мэдээ, 2020 он

# Өгөгдөл ачаалах ---------------------------------------------------------

mac <- read.csv(file = "mac_messy.csv", stringsAsFactors = FALSE)

View(mac)

# Ачаалсан өгөгдөл дараах хэлбэртэй байна
#    ID                                                                                                                   MAC_address
# 1 118 38:F9:D3:58:9C:C1,82:3D:29:65:E4:01,82:3D:29:65:E4:00,82:3D:29:65:E4:01,0A:F9:D3:58:9C:C1,06:A6:5B:1E:80:02,06:A6:5B:1E:80:02
# 2 120                                                                         98-E7-43-57-69-D7,D8-12-65-75-87-07,D8-12-65-75-87-08
# 3 106                                                                                           FC-01-7C-59-44-6F,FC-01-7C-59-44-70
# 4 127                                                                         98-E7-43-57-69-D7,D8-12-65-75-87-07,D8-12-65-75-87-08
# 5 125                                                                                           80-C5-F2-94-B7-D0,80-C5-F2-94-B7-D1
# 6 126                                                       20-6A-8A-EF-76-4B,9C-2A-70-7E-89-5D,9C-2A-70-7E-89-5E,2E-2A-70-7E-89-5D

# Уг өгөгдөлд ID болон MAC_address гэсэн хоёр санамсаргүй хувьсагч байна. Гэвч MAC_address хувьсагчийн зарим утгуудыг таслалаар тусгаарлаж оруулсан нь зохимжгүй бөгөөд үүнийг нь засаж тус өгөгдлийг зөв хэлбэрт оруулах шаардлагатай.

# MAC_address хувьсагчийн утгуудыг дан том үсэг уруу хувиргах -------------

# MAC_address хувьсагчийн утгуудын заримыг том үсгээр заримыг жижиг үсгээр бичжээ. Эдгээрийг аль нэг хэлбэр уруу нь шилжүүлбэл зохино. Үүнд ашиглаж болох функцийг жишээлбэл "r language upper case" түлхүүр үгээр хайн олж болно.

mac$MAC_address <- toupper(mac$MAC_address)

# Өгөгдөл эмхлэх үндсэн үйлдэл --------------------------------------------

# Эмхэлсэн өгөгдөл нь ID болон MAC_address гэсэн хоёр хувьсагч буюу баганатай хүснэгт хэлбэртэй байх бөгөөд MAC_address хувьсагчийн хувьд нэг мак хаяг хүснэгтийн нэг мөрд буюу нэг нүдэнд байна.

ID <- NULL; MAC_address <- NULL # шинээр эмхэлж буй өгөгдлийг хадгалах векторууд

for (i in 1:nrow(mac)) { # mac датафреймын мөрүүдээр гүйх давталт
  macs <- strsplit(x = mac$MAC_address[i], split = ",")[[1]] # Статистик програмчлалын R хэл сурах бичигт авч үзсэн функц
  ids <- rep(x = mac$ID[i], times = length(macs)) # R хэлний курс хичээл дээр үздэг функц
  ID <- c(ID, ids)
  MAC_address <- c(MAC_address, macs)
}

MAC <- data.frame(ID, MAC_address) # шинээр зохиосон векторуудыг агуулсан, эмхэлсэн өгөгдөл бүхий датафрейм үүсгэх

View(MAC) # эмхэлсэн өгөгдлөө харах

# Ийнхүү дараах хэлбэртэй үр дүн гарна
#     ID       MAC_address
# 1  118 38:F9:D3:58:9C:C1
# 2  118 82:3D:29:65:E4:01
# 3  118 82:3D:29:65:E4:00
# 4  118 82:3D:29:65:E4:01
# 5  118 0A:F9:D3:58:9C:C1
# 6  118 06:A6:5B:1E:80:02
# 7  118 06:A6:5B:1E:80:02
# 8  120 98-E7-43-57-69-D7
# 9  120 D8-12-65-75-87-07
# 10 120 D8-12-65-75-87-08
# 11 106 FC-01-7C-59-44-6F
# 12 106 FC-01-7C-59-44-70
# гэх мэт

write.csv(x = MAC, file = "mac_tidy.csv", row.names = FALSE) # Гарсан үр дүнг CSV форматаар экспортлох
