
# Ашигласан өгөгдлийн эх сурвалж ------------------------------------------

# https://www.1212.mn/tables.aspx?tbl_id=DT_NSO_2300_006V2

# "1212.xlsx" файл дахь өгөгдөлд 1. Статистик үзүүлэлт 2. Аймаг 3. Код 4. Он 5. Тоон утга гэсэн дөрвөн санамсаргүй хувьсагч байна.

# Өгөгдөл ачаалах ---------------------------------------------------------

messy <- readxl::read_excel(
  path = "DT_NSO_2300_006V2_-_www.1212.mn.xlsx",
  trim_ws = TRUE, # нүдний эхлэл дэх сул зайг арилгах
  skip = 1
)

View(messy)

# Өгөгдлийн бүтэц зохион байгуулалт ---------------------------------------

# Тус өгөгдөл нь угтаа хамааралгүй түүвэр атал өргөн бүтцээр зохион байгуулжээ. Иймд хамааралгүй түүврийн зөв хэлбэр болох өргөн бүтэц уруу шилжүүлэх шаардлагатай.
tidy <- reshape2::melt(
  data = messy,
  measure.vars = as.character(2017:2020),
  variable.name = "year",
  value = "value"
)

# эмхэлсэн өгөгдлөө харах
View(tidy)

# Файлд хадгалах ----------------------------------------------------------

write.csv(x = tidy, file = "tidy.csv", row.names = FALSE) # Гарсан үр дүнг CSV форматаар экспортлох
