
# Ашигласан өгөгдлийн эх сурвалж ------------------------------------------

# https://www.1212.mn/

# "DT_NSO_1200_012V7_-_www.1212.mn.xlsx" файл дахь өгөгдөлд 1. Үзүүлэлт 2. Огноо 3. Тоо хэмжээ гэсэн үндсэн гурван санамсаргүй хувьсагч байна.

# Өгөгдөл ачаалах ---------------------------------------------------------

messy_data <- readr::read_csv(file = "DT_NSO_1200_012V7_www.1212.mn.csv")

View(messy_data)

# Өгөгдлийн бүтэц зохион байгуулалт ---------------------------------------

# Үзүүлэлт хувьсагчийн утга дээрх зарим засвар
messy_data$`Үзүүлэлт`[2:5] <- paste(messy_data$`Үзүүлэлт`[1], messy_data$`Үзүүлэлт`[2:5], sep = " - ")
messy_data$`Үзүүлэлт`[7:10] <- paste(messy_data$`Үзүүлэлт`[6], messy_data$`Үзүүлэлт`[7:10], sep = " - ")
messy_data$`Үзүүлэлт`[29:30] <- paste(messy_data$`Үзүүлэлт`[28], messy_data$`Үзүүлэлт`[29:30], sep = " - ")

# Өргөн бүтцээс урт бүтэц уруу шилжүүлэх
tidy_data <- reshape2::melt(
  data = messy_data,
  measure.vars = colnames(messy_data)[-1],
  variable.name = "year",
  value = "value"
)

# Орхигдсон утгуудыг зайлуулах
tidy_data <- na.omit(tidy_data)

# эмхэлсэн өгөгдлөө харах
View(tidy_data)

# Файлд хадгалах ----------------------------------------------------------

write.csv(x = tidy_data, file = "tidy_data.csv", row.names = FALSE) # Гарсан үр дүнг CSV форматаар экспортлох
