##
## Parallel Computing with package foreach
##
## @author:  galaa
## @web:     www.galaa.mn
## @created: 2017/06/28 11:10:30
##

## -----------------------------------------------------------------
## Тайлбар
## -----------------------------------------------------------------

# Зэрэгцээ тооцооллын талаарх зарим ерөнхий тайлбарыг "Parallel Computing with package parallel.R" файлаар өгсөн.

## -----------------------------------------------------------------
## Багц ачаалах
## -----------------------------------------------------------------

library(doParallel)

## -----------------------------------------------------------------
## CPU/Цөмийн тоог тогтоох
## -----------------------------------------------------------------

the.number.of.useful.cores <- max(1, detectCores() - 1)

## -----------------------------------------------------------------
## Зэрэгцээ тооцооллын кластер үүсгэх
## -----------------------------------------------------------------

## 1-р арга

parallel.computing.clusters <- makeCluster(the.number.of.useful.cores)
registerDoParallel(parallel.computing.clusters)

## 2-р арга

registerDoParallel(cores = the.number.of.useful.cores)

## ----------------------------------------------------------------
## Зэрэгцээ тооцооллын функц
## ----------------------------------------------------------------

foreach(numbers = 1:10, .combine = c) %dopar% {
  sqrt(numbers)
}

## ----------------------------------------------------------------
## Хувьсагчийн утга дамжуулах
## ----------------------------------------------------------------

# Энэ нь угтаа үйлдлийн системээс шалтгаална.
# Unix-төст системүүдийн хувьд fork төрлийн зэрэгцээ тооцооллыг дэмжих тул утга дамжуулах хувьсагчаа тусгайлан заах шаардлагагүй.
# Өөрөөр хэлбэл doParallel багцын хувьд Unix-төст үйлдлийн системүүд дээр multicore харин Windows үйлдлийн систем дээр snow үйл ажиллагааг ашигладаг.

## Хувьсагч

root <- 0.5

## Ердийн тохиолдолд хувьсагчийн утга дамжуулах талаар ярих шаардлагагүй

foreach(numbers = 1:10, .combine = c) %dopar% {
  numbers ^ root
}

## Хувьсагч болон foreach() функцийг хүрээ дамнуулан ашиглах тохиолдол

# Windows үйлдлийн систем дээр fork дэмжигдэхгүй өөрөөр хэлбэл эх хүрээний хувьсагчид уруу шууд хандах боломжгүй тул хувьсагчдыг тусгайлан дамжуулж өгөх шаардлагатай. Тодруулбал .export аргументийг хассан үед Windows дээр алдаа өгнө.

user.func <- function() {
  foreach(numbers = 1:10, .combine = c, .export = "root") %dopar% {
    numbers ^ root
  }
}

root <- 2 # хувьсагчийн утгыг дараа нь өөрчлөх боломжтой.

user.func()

## ----------------------------------------------------------------
## Кластер устгах
## ----------------------------------------------------------------

stopCluster(parallel.computing.clusters) # Зэрэгцээ тооцооллын кластер үүсгэх 1-р арга ашигласан үед уг тушаалыг өгнө
