#
# Linear Regression
# Seminar 3
# Author: galaa
# Created on 2016/10/07 15:30:00
#

# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

# Exercise 1

# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

# Data

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

y = c(-7.4, 14.5, 9.9, 2.3, 3.1, 3.3, -0.1, -2.8, 10.8, -4.5, 14.9, -2.7, 14.3, 13.1, 28.6)

print(y)

X = matrix(
  data = c(1.6, 9.7, 4.7, 7.8, 4.1, 5.4, 2.1, 1.9, 7.8, 1.9, 4.3, 0, 8.3, 8.3, 9.6, 2.7, 1, -0.7, 1.2, 0.6, 2.4, 1, 1.7, 2, 2.5, -1.5, 0.9, 0.9, 2.7, -0.9, 4.7, 9.2, 5.8, 8.1, 8.2, 8.4, 1.6, 1.4, 13.4, 2, 10.8, 5.6, 6.3, 6.9, 1.4),
  nrow = 15,
  ncol = 3,
  byrow = FALSE
)

print(X)

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

# by using function lm() from the package stats

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

lm(y ~ X)

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

# Detailed computation

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

# sample size

n = length(y)

# add constant term

X <- cbind(rep(x = 1, times = n), X)

# parameter estimation

b.hat = solve(t(X) %*% X) %*% t(X) %*% y

print(b.hat)

# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

# Exercise 2

# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

# Data

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

y = c(-7.4, 14.5, 9.9, 2.3, 3.1, 3.3, -0.1, -2.8, 10.8, -4.5, 14.9, -2.7, 14.3, 13.1, 28.6)

print(y)

X = matrix(
  data = c(1.6, 9.7, 4.7, 7.8, 4.1, 5.4, 2.1, 1.9, 7.8, 1.9, 4.3, 0, 8.3, 8.3, 9.6, 2.7, 1, -0.7, 1.2, 0.6, 2.4, 1, 1.7, 2, 2.5, -1.5, 0.9, 0.9, 2.7, -0.9, 4.7, 9.2, 5.8, 8.1, 8.2, 8.4, 1.6, 1.4, 13.4, 2, 10.8, 5.6, 6.3, 6.9, 1.4),
  nrow = 15,
  ncol = 3,
  byrow = FALSE
)

print(X)

X2 = X[ , 1]
X3 = X[ , 2]
X4 = X[ , 3]

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

# entering a linear model into function lm()

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

summary(lm(y ~ X2 + X3)) # y = b1 + b2 * X2 + b3 * X3

summary(lm(y ~ X2 + X3 + X4)) # y = b1 + b2 * X2 + b3 * X3 + b4 * X4

# formula : definition of linear model

summary(lm(y ~ X2 + 0)) # тогтмолыг хасах +0, -1

summary(lm(y ~ X2 : X3)) # хүчин зүйлсийн үржвэр

summary(lm(y ~ X2 * X3)) # хүчин зүйлсийн боломжит бүх хувилбар

summary(lm(y ~ (X2 + X3) ^2 )) # хүчин зүйлсийн боломжит бүх хувилбар

summary(lm(y ~ (X2 + X3) ^2 - X2 )) # хүчин зүйлийг хасах

summary(lm(y ~ exp(X2) + X3)) # хувьсагчид дээрх хувиргалт
